<template>
  <div>
    <h1>Правила игры:</h1>
    <ul>
    	<li>
    		Программа случайным образом выбирает локацию. Локация представляет собой какое-то определённое место – Кондитерская фабрика, Киностудия, Колхоз и т.п.
    	</li>
    	<li>
    		Случайным образом выбирается шпион, а мирным жителям сообщается локация.
    	</li>
    	<li>
    		Игроки задают друг другу вопросы и по ответам пытаются вычислить шпиона. Шпион по ответам остальных игроков пытается определить локацию, в то же время сам старается не попасться. Поэтому ответы «мирных» должны быть такими, чтобы знающий человек мог догадаться, о чём речь, а шпион не мог. Вопросы могут быть любыми. Вопрос задают игроку слева, и право следующего вопроса передается по часовой стрелке. Естественно, шпион маскируется под «мирного игрока», он тоже задаёт свои вопросы и отвечает на вопросы к нему.
    	</li>
    	<li>Игра заканчивается, когда какой-нибудь игрок вычислит шпиона или шпион угадает локацию.</li>
    </ul>
  </div>
</template>

<script>
	export default {
		name: 'rules',
		data: function () {
			return {
				loading: false
			}
		}
	}
</script>